/*===========================================================================
   Copyright (c) 2019-2020 Qualcomm Technologies, Inc.
   All Rights Reserved.
   Confidential and Proprietary - Qualcomm Technologies, Inc.
===========================================================================*/

#ifndef HIDL_GENERATED_VENDOR_QTI_HARDWARE_RADIO_IMS_V1_6_TYPES_H
#define HIDL_GENERATED_VENDOR_QTI_HARDWARE_RADIO_IMS_V1_6_TYPES_H

#include <vendor/qti/hardware/radio/ims/1.0/types.h>
#include <vendor/qti/hardware/radio/ims/1.2/types.h>
#include <vendor/qti/hardware/radio/ims/1.3/types.h>
#include <vendor/qti/hardware/radio/ims/1.4/types.h>
#include <vendor/qti/hardware/radio/ims/1.5/types.h>

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace vendor {
namespace qti {
namespace hardware {
namespace radio {
namespace ims {
namespace V1_6 {

// Forward declaration for forward reference support:
enum class ConfigItem : int32_t;
struct ConfigInfo;
enum class RadioTechType : int32_t;
struct RegistrationInfo;
struct StatusForAccessTech;
enum class CallType : int32_t;
struct ServiceStatusInfo;
struct CallDetails;
struct RedialInfo;
struct DialRequest;
struct CallInfo;
struct HandoverInfo;
struct CallLocation;
enum class CallPriority : int32_t;
struct CallComposerInfo;
struct AutoCallRejectionInfo;
enum class GeoLocationDataStatus : int32_t;

// Order of inner types was changed for forward reference support.

enum class ConfigItem : int32_t {
    CONFIG_ITEM_NONE = 0,
    CONFIG_ITEM_VOCODER_AMRMODESET = 1 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_NONE implicitly + 1) */,
    CONFIG_ITEM_VOCODER_AMRWBMODESET = 2 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_VOCODER_AMRMODESET implicitly + 1) */,
    CONFIG_ITEM_SIP_SESSION_TIMER = 3 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_VOCODER_AMRWBMODESET implicitly + 1) */,
    CONFIG_ITEM_MIN_SESSION_EXPIRY = 4 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SIP_SESSION_TIMER implicitly + 1) */,
    CONFIG_ITEM_CANCELLATION_TIMER = 5 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_MIN_SESSION_EXPIRY implicitly + 1) */,
    CONFIG_ITEM_T_DELAY = 6 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_CANCELLATION_TIMER implicitly + 1) */,
    CONFIG_ITEM_SILENT_REDIAL_ENABLE = 7 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_T_DELAY implicitly + 1) */,
    CONFIG_ITEM_SIP_T1_TIMER = 8 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SILENT_REDIAL_ENABLE implicitly + 1) */,
    CONFIG_ITEM_SIP_T2_TIMER = 9 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SIP_T1_TIMER implicitly + 1) */,
    CONFIG_ITEM_SIP_TF_TIMER = 10 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SIP_T2_TIMER implicitly + 1) */,
    CONFIG_ITEM_VLT_SETTING_ENABLED = 11 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SIP_TF_TIMER implicitly + 1) */,
    CONFIG_ITEM_LVC_SETTING_ENABLED = 12 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_VLT_SETTING_ENABLED implicitly + 1) */,
    CONFIG_ITEM_DOMAIN_NAME = 13 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_LVC_SETTING_ENABLED implicitly + 1) */,
    CONFIG_ITEM_SMS_FORMAT = 14 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_DOMAIN_NAME implicitly + 1) */,
    CONFIG_ITEM_SMS_OVER_IP = 15 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SMS_FORMAT implicitly + 1) */,
    CONFIG_ITEM_PUBLISH_TIMER = 16 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SMS_OVER_IP implicitly + 1) */,
    CONFIG_ITEM_PUBLISH_TIMER_EXTENDED = 17 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_PUBLISH_TIMER implicitly + 1) */,
    CONFIG_ITEM_CAPABILITIES_CACHE_EXPIRATION = 18 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_PUBLISH_TIMER_EXTENDED implicitly + 1) */,
    CONFIG_ITEM_AVAILABILITY_CACHE_EXPIRATION = 19 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_CAPABILITIES_CACHE_EXPIRATION implicitly + 1) */,
    CONFIG_ITEM_CAPABILITIES_POLL_INTERVAL = 20 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_AVAILABILITY_CACHE_EXPIRATION implicitly + 1) */,
    CONFIG_ITEM_SOURCE_THROTTLE_PUBLISH = 21 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_CAPABILITIES_POLL_INTERVAL implicitly + 1) */,
    CONFIG_ITEM_MAX_NUM_ENTRIES_IN_RCL = 22 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SOURCE_THROTTLE_PUBLISH implicitly + 1) */,
    CONFIG_ITEM_CAPAB_POLL_LIST_SUB_EXP = 23 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_MAX_NUM_ENTRIES_IN_RCL implicitly + 1) */,
    CONFIG_ITEM_GZIP_FLAG = 24 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_CAPAB_POLL_LIST_SUB_EXP implicitly + 1) */,
    CONFIG_ITEM_EAB_SETTING_ENABLED = 25 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_GZIP_FLAG implicitly + 1) */,
    CONFIG_ITEM_MOBILE_DATA_ENABLED = 26 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_EAB_SETTING_ENABLED implicitly + 1) */,
    CONFIG_ITEM_VOICE_OVER_WIFI_ENABLED = 27 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_MOBILE_DATA_ENABLED implicitly + 1) */,
    CONFIG_ITEM_VOICE_OVER_WIFI_ROAMING = 28 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_VOICE_OVER_WIFI_ENABLED implicitly + 1) */,
    CONFIG_ITEM_VOICE_OVER_WIFI_MODE = 29 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_VOICE_OVER_WIFI_ROAMING implicitly + 1) */,
    CONFIG_ITEM_CAPABILITY_DISCOVERY_ENABLED = 30 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_VOICE_OVER_WIFI_MODE implicitly + 1) */,
    CONFIG_ITEM_EMERGENCY_CALL_TIMER = 31 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_CAPABILITY_DISCOVERY_ENABLED implicitly + 1) */,
    CONFIG_ITEM_SSAC_HYSTERESIS_TIMER = 32 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_EMERGENCY_CALL_TIMER implicitly + 1) */,
    CONFIG_ITEM_VOLTE_USER_OPT_IN_STATUS = 33 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SSAC_HYSTERESIS_TIMER implicitly + 1) */,
    CONFIG_ITEM_LBO_PCSCF_ADDRESS = 34 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_VOLTE_USER_OPT_IN_STATUS implicitly + 1) */,
    CONFIG_ITEM_KEEP_ALIVE_ENABLED = 35 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_LBO_PCSCF_ADDRESS implicitly + 1) */,
    CONFIG_ITEM_REGISTRATION_RETRY_BASE_TIME_SEC = 36 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_KEEP_ALIVE_ENABLED implicitly + 1) */,
    CONFIG_ITEM_REGISTRATION_RETRY_MAX_TIME_SEC = 37 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_REGISTRATION_RETRY_BASE_TIME_SEC implicitly + 1) */,
    CONFIG_ITEM_SPEECH_START_PORT = 38 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_REGISTRATION_RETRY_MAX_TIME_SEC implicitly + 1) */,
    CONFIG_ITEM_SPEECH_END_PORT = 39 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SPEECH_START_PORT implicitly + 1) */,
    CONFIG_ITEM_SIP_INVITE_REQ_RETX_INTERVAL_MSEC = 40 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SPEECH_END_PORT implicitly + 1) */,
    CONFIG_ITEM_SIP_INVITE_RSP_WAIT_TIME_MSEC = 41 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SIP_INVITE_REQ_RETX_INTERVAL_MSEC implicitly + 1) */,
    CONFIG_ITEM_SIP_INVITE_RSP_RETX_WAIT_TIME_MSEC = 42 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SIP_INVITE_RSP_WAIT_TIME_MSEC implicitly + 1) */,
    CONFIG_ITEM_SIP_NON_INVITE_REQ_RETX_INTERVAL_MSEC = 43 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SIP_INVITE_RSP_RETX_WAIT_TIME_MSEC implicitly + 1) */,
    CONFIG_ITEM_SIP_NON_INVITE_TXN_TIMEOUT_TIMER_MSEC = 44 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SIP_NON_INVITE_REQ_RETX_INTERVAL_MSEC implicitly + 1) */,
    CONFIG_ITEM_SIP_INVITE_RSP_RETX_INTERVAL_MSEC = 45 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SIP_NON_INVITE_TXN_TIMEOUT_TIMER_MSEC implicitly + 1) */,
    CONFIG_ITEM_SIP_ACK_RECEIPT_WAIT_TIME_MSEC = 46 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SIP_INVITE_RSP_RETX_INTERVAL_MSEC implicitly + 1) */,
    CONFIG_ITEM_SIP_ACK_RETX_WAIT_TIME_MSEC = 47 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SIP_ACK_RECEIPT_WAIT_TIME_MSEC implicitly + 1) */,
    CONFIG_ITEM_SIP_NON_INVITE_REQ_RETX_WAIT_TIME_MSEC = 48 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SIP_ACK_RETX_WAIT_TIME_MSEC implicitly + 1) */,
    CONFIG_ITEM_SIP_NON_INVITE_RSP_RETX_WAIT_TIME_MSEC = 49 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SIP_NON_INVITE_REQ_RETX_WAIT_TIME_MSEC implicitly + 1) */,
    CONFIG_ITEM_AMR_WB_OCTET_ALIGNED_PT = 50 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SIP_NON_INVITE_RSP_RETX_WAIT_TIME_MSEC implicitly + 1) */,
    CONFIG_ITEM_AMR_WB_BANDWIDTH_EFFICIENT_PT = 51 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_AMR_WB_OCTET_ALIGNED_PT implicitly + 1) */,
    CONFIG_ITEM_AMR_OCTET_ALIGNED_PT = 52 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_AMR_WB_BANDWIDTH_EFFICIENT_PT implicitly + 1) */,
    CONFIG_ITEM_AMR_BANDWIDTH_EFFICIENT_PT = 53 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_AMR_OCTET_ALIGNED_PT implicitly + 1) */,
    CONFIG_ITEM_DTMF_WB_PT = 54 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_AMR_BANDWIDTH_EFFICIENT_PT implicitly + 1) */,
    CONFIG_ITEM_DTMF_NB_PT = 55 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_DTMF_WB_PT implicitly + 1) */,
    CONFIG_ITEM_AMR_DEFAULT_MODE = 56 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_DTMF_NB_PT implicitly + 1) */,
    CONFIG_ITEM_SMS_PSI = 57 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_AMR_DEFAULT_MODE implicitly + 1) */,
    CONFIG_ITEM_VIDEO_QUALITY = 58 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SMS_PSI implicitly + 1) */,
    CONFIG_ITEM_THRESHOLD_LTE1 = 59 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_VIDEO_QUALITY implicitly + 1) */,
    CONFIG_ITEM_THRESHOLD_LTE2 = 60 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_THRESHOLD_LTE1 implicitly + 1) */,
    CONFIG_ITEM_THRESHOLD_LTE3 = 61 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_THRESHOLD_LTE2 implicitly + 1) */,
    CONFIG_ITEM_THRESHOLD_1x = 62 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_THRESHOLD_LTE3 implicitly + 1) */,
    CONFIG_ITEM_THRESHOLD_WIFI_A = 63 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_THRESHOLD_1x implicitly + 1) */,
    CONFIG_ITEM_THRESHOLD_WIFI_B = 64 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_THRESHOLD_WIFI_A implicitly + 1) */,
    CONFIG_ITEM_T_EPDG_LTE = 65 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_THRESHOLD_WIFI_B implicitly + 1) */,
    CONFIG_ITEM_T_EPDG_WIFI = 66 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_T_EPDG_LTE implicitly + 1) */,
    CONFIG_ITEM_T_EPDG_1x = 67 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_T_EPDG_WIFI implicitly + 1) */,
    CONFIG_ITEM_VWF_SETTING_ENABLED = 68 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_T_EPDG_1x implicitly + 1) */,
    CONFIG_ITEM_VCE_SETTING_ENABLED = 69 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_VWF_SETTING_ENABLED implicitly + 1) */,
    CONFIG_ITEM_RTT_SETTING_ENABLED = 70 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_VCE_SETTING_ENABLED implicitly + 1) */,
    CONFIG_ITEM_SMS_APP = 71 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_RTT_SETTING_ENABLED implicitly + 1) */,
    CONFIG_ITEM_VVM_APP = 72 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SMS_APP implicitly + 1) */,
    CONFIG_ITEM_INVALID = 73 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_VVM_APP implicitly + 1) */,
    CONFIG_ITEM_VOICE_OVER_WIFI_ROAMING_MODE = 74 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_INVALID implicitly + 1) */,
    CONFIG_ITEM_SET_AUTO_REJECT_CALL_MODE_CONFIG = 75 /* (::vendor::qti::hardware::radio::ims::V1_5::ConfigItem.CONFIG_ITEM_VOICE_OVER_WIFI_ROAMING_MODE implicitly + 1) */,
    CONFIG_ITEM_VOWIFI_FQDN = 76 /* (::vendor::qti::hardware::radio::ims::V1_6::ConfigItem.CONFIG_ITEM_SET_AUTO_REJECT_CALL_MODE_CONFIG implicitly + 1) */,
    CONFIG_ITEM_MMTEL_CALL_COMPOSER_CONFIG = 77 /* (::vendor::qti::hardware::radio::ims::V1_6::ConfigItem.CONFIG_ITEM_VOWIFI_FQDN implicitly + 1) */,
};

struct ConfigInfo final {
    ::vendor::qti::hardware::radio::ims::V1_6::ConfigItem item __attribute__ ((aligned(4)));
    bool hasBoolValue __attribute__ ((aligned(1)));
    bool boolValue __attribute__ ((aligned(1)));
    uint32_t intValue __attribute__ ((aligned(4)));
    ::android::hardware::hidl_string stringValue __attribute__ ((aligned(8)));
    ::vendor::qti::hardware::radio::ims::V1_0::ConfigFailureCause errorCause __attribute__ ((aligned(4)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::ConfigInfo, item) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::ConfigInfo, hasBoolValue) == 4, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::ConfigInfo, boolValue) == 5, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::ConfigInfo, intValue) == 8, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::ConfigInfo, stringValue) == 16, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::ConfigInfo, errorCause) == 32, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_6::ConfigInfo) == 40, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_6::ConfigInfo) == 8, "wrong alignment");

enum class RadioTechType : int32_t {
    RADIO_TECH_ANY = 0,
    RADIO_TECH_UNKNOWN = 1 /* (::vendor::qti::hardware::radio::ims::V1_0::RadioTechType.RADIO_TECH_ANY implicitly + 1) */,
    RADIO_TECH_GPRS = 2 /* (::vendor::qti::hardware::radio::ims::V1_0::RadioTechType.RADIO_TECH_UNKNOWN implicitly + 1) */,
    RADIO_TECH_EDGE = 3 /* (::vendor::qti::hardware::radio::ims::V1_0::RadioTechType.RADIO_TECH_GPRS implicitly + 1) */,
    RADIO_TECH_UMTS = 4 /* (::vendor::qti::hardware::radio::ims::V1_0::RadioTechType.RADIO_TECH_EDGE implicitly + 1) */,
    RADIO_TECH_IS95A = 5 /* (::vendor::qti::hardware::radio::ims::V1_0::RadioTechType.RADIO_TECH_UMTS implicitly + 1) */,
    RADIO_TECH_IS95B = 6 /* (::vendor::qti::hardware::radio::ims::V1_0::RadioTechType.RADIO_TECH_IS95A implicitly + 1) */,
    RADIO_TECH_1xRTT = 7 /* (::vendor::qti::hardware::radio::ims::V1_0::RadioTechType.RADIO_TECH_IS95B implicitly + 1) */,
    RADIO_TECH_EVDO_0 = 8 /* (::vendor::qti::hardware::radio::ims::V1_0::RadioTechType.RADIO_TECH_1xRTT implicitly + 1) */,
    RADIO_TECH_EVDO_A = 9 /* (::vendor::qti::hardware::radio::ims::V1_0::RadioTechType.RADIO_TECH_EVDO_0 implicitly + 1) */,
    RADIO_TECH_HSDPA = 10 /* (::vendor::qti::hardware::radio::ims::V1_0::RadioTechType.RADIO_TECH_EVDO_A implicitly + 1) */,
    RADIO_TECH_HSUPA = 11 /* (::vendor::qti::hardware::radio::ims::V1_0::RadioTechType.RADIO_TECH_HSDPA implicitly + 1) */,
    RADIO_TECH_HSPA = 12 /* (::vendor::qti::hardware::radio::ims::V1_0::RadioTechType.RADIO_TECH_HSUPA implicitly + 1) */,
    RADIO_TECH_EVDO_B = 13 /* (::vendor::qti::hardware::radio::ims::V1_0::RadioTechType.RADIO_TECH_HSPA implicitly + 1) */,
    RADIO_TECH_EHRPD = 14 /* (::vendor::qti::hardware::radio::ims::V1_0::RadioTechType.RADIO_TECH_EVDO_B implicitly + 1) */,
    RADIO_TECH_LTE = 15 /* (::vendor::qti::hardware::radio::ims::V1_0::RadioTechType.RADIO_TECH_EHRPD implicitly + 1) */,
    RADIO_TECH_HSPAP = 16 /* (::vendor::qti::hardware::radio::ims::V1_0::RadioTechType.RADIO_TECH_LTE implicitly + 1) */,
    RADIO_TECH_GSM = 17 /* (::vendor::qti::hardware::radio::ims::V1_0::RadioTechType.RADIO_TECH_HSPAP implicitly + 1) */,
    RADIO_TECH_TD_SCDMA = 18 /* (::vendor::qti::hardware::radio::ims::V1_0::RadioTechType.RADIO_TECH_GSM implicitly + 1) */,
    RADIO_TECH_WIFI = 19 /* (::vendor::qti::hardware::radio::ims::V1_0::RadioTechType.RADIO_TECH_TD_SCDMA implicitly + 1) */,
    RADIO_TECH_IWLAN = 20 /* (::vendor::qti::hardware::radio::ims::V1_0::RadioTechType.RADIO_TECH_WIFI implicitly + 1) */,
    RADIO_TECH_INVALID = 21 /* (::vendor::qti::hardware::radio::ims::V1_0::RadioTechType.RADIO_TECH_IWLAN implicitly + 1) */,
    RADIO_TECH_NR5G = 22 /* (::vendor::qti::hardware::radio::ims::V1_0::RadioTechType.RADIO_TECH_INVALID implicitly + 1) */,
};

struct RegistrationInfo final {
    ::vendor::qti::hardware::radio::ims::V1_0::RegState state __attribute__ ((aligned(4)));
    uint32_t errorCode __attribute__ ((aligned(4)));
    ::android::hardware::hidl_string errorMessage __attribute__ ((aligned(8)));
    ::vendor::qti::hardware::radio::ims::V1_6::RadioTechType radioTech __attribute__ ((aligned(4)));
    ::android::hardware::hidl_string pAssociatedUris __attribute__ ((aligned(8)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::RegistrationInfo, state) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::RegistrationInfo, errorCode) == 4, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::RegistrationInfo, errorMessage) == 8, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::RegistrationInfo, radioTech) == 24, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::RegistrationInfo, pAssociatedUris) == 32, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_6::RegistrationInfo) == 48, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_6::RegistrationInfo) == 8, "wrong alignment");

struct StatusForAccessTech final {
    ::vendor::qti::hardware::radio::ims::V1_6::RadioTechType networkMode __attribute__ ((aligned(4)));
    ::vendor::qti::hardware::radio::ims::V1_0::StatusType status __attribute__ ((aligned(4)));
    uint32_t restrictCause __attribute__ ((aligned(4)));
    bool hasRegistration __attribute__ ((aligned(1)));
    ::vendor::qti::hardware::radio::ims::V1_6::RegistrationInfo registration __attribute__ ((aligned(8)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::StatusForAccessTech, networkMode) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::StatusForAccessTech, status) == 4, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::StatusForAccessTech, restrictCause) == 8, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::StatusForAccessTech, hasRegistration) == 12, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::StatusForAccessTech, registration) == 16, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_6::StatusForAccessTech) == 64, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_6::StatusForAccessTech) == 8, "wrong alignment");

enum class CallType : int32_t {
    CALL_TYPE_VOICE = 0,
    CALL_TYPE_VT_TX = 1 /* (::vendor::qti::hardware::radio::ims::V1_0::CallType.CALL_TYPE_VOICE implicitly + 1) */,
    CALL_TYPE_VT_RX = 2 /* (::vendor::qti::hardware::radio::ims::V1_0::CallType.CALL_TYPE_VT_TX implicitly + 1) */,
    CALL_TYPE_VT = 3 /* (::vendor::qti::hardware::radio::ims::V1_0::CallType.CALL_TYPE_VT_RX implicitly + 1) */,
    CALL_TYPE_VT_NODIR = 4 /* (::vendor::qti::hardware::radio::ims::V1_0::CallType.CALL_TYPE_VT implicitly + 1) */,
    CALL_TYPE_CS_VS_TX = 5 /* (::vendor::qti::hardware::radio::ims::V1_0::CallType.CALL_TYPE_VT_NODIR implicitly + 1) */,
    CALL_TYPE_CS_VS_RX = 6 /* (::vendor::qti::hardware::radio::ims::V1_0::CallType.CALL_TYPE_CS_VS_TX implicitly + 1) */,
    CALL_TYPE_PS_VS_TX = 7 /* (::vendor::qti::hardware::radio::ims::V1_0::CallType.CALL_TYPE_CS_VS_RX implicitly + 1) */,
    CALL_TYPE_PS_VS_RX = 8 /* (::vendor::qti::hardware::radio::ims::V1_0::CallType.CALL_TYPE_PS_VS_TX implicitly + 1) */,
    CALL_TYPE_UNKNOWN = 9 /* (::vendor::qti::hardware::radio::ims::V1_0::CallType.CALL_TYPE_PS_VS_RX implicitly + 1) */,
    CALL_TYPE_SMS = 10 /* (::vendor::qti::hardware::radio::ims::V1_0::CallType.CALL_TYPE_UNKNOWN implicitly + 1) */,
    CALL_TYPE_UT = 11 /* (::vendor::qti::hardware::radio::ims::V1_0::CallType.CALL_TYPE_SMS implicitly + 1) */,
    CALL_TYPE_INVALID = 12 /* (::vendor::qti::hardware::radio::ims::V1_0::CallType.CALL_TYPE_UT implicitly + 1) */,
    CALL_TYPE_USSD = 13 /* (::vendor::qti::hardware::radio::ims::V1_0::CallType.CALL_TYPE_INVALID implicitly + 1) */,
    CALL_TYPE_CALLCOMPOSER = 14 /* (::vendor::qti::hardware::radio::ims::V1_6::CallType.CALL_TYPE_USSD implicitly + 1) */,
};

struct ServiceStatusInfo final {
    bool hasIsValid __attribute__ ((aligned(1)));
    bool isValid __attribute__ ((aligned(1)));
    ::vendor::qti::hardware::radio::ims::V1_0::ServiceType type __attribute__ ((aligned(4)));
    ::vendor::qti::hardware::radio::ims::V1_6::CallType callType __attribute__ ((aligned(4)));
    ::vendor::qti::hardware::radio::ims::V1_0::StatusType status __attribute__ ((aligned(4)));
    ::android::hardware::hidl_vec<uint8_t> userdata __attribute__ ((aligned(8)));
    uint32_t restrictCause __attribute__ ((aligned(4)));
    ::android::hardware::hidl_vec<::vendor::qti::hardware::radio::ims::V1_6::StatusForAccessTech> accTechStatus __attribute__ ((aligned(8)));
    ::vendor::qti::hardware::radio::ims::V1_0::RttMode rttMode __attribute__ ((aligned(4)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::ServiceStatusInfo, hasIsValid) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::ServiceStatusInfo, isValid) == 1, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::ServiceStatusInfo, type) == 4, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::ServiceStatusInfo, callType) == 8, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::ServiceStatusInfo, status) == 12, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::ServiceStatusInfo, userdata) == 16, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::ServiceStatusInfo, restrictCause) == 32, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::ServiceStatusInfo, accTechStatus) == 40, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::ServiceStatusInfo, rttMode) == 56, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_6::ServiceStatusInfo) == 64, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_6::ServiceStatusInfo) == 8, "wrong alignment");

struct CallDetails final {
    ::vendor::qti::hardware::radio::ims::V1_6::CallType callType __attribute__ ((aligned(4)));
    ::vendor::qti::hardware::radio::ims::V1_0::CallDomain callDomain __attribute__ ((aligned(4)));
    uint32_t extrasLength __attribute__ ((aligned(4)));
    ::android::hardware::hidl_vec<::android::hardware::hidl_string> extras __attribute__ ((aligned(8)));
    ::android::hardware::hidl_vec<::vendor::qti::hardware::radio::ims::V1_6::ServiceStatusInfo> localAbility __attribute__ ((aligned(8)));
    ::android::hardware::hidl_vec<::vendor::qti::hardware::radio::ims::V1_6::ServiceStatusInfo> peerAbility __attribute__ ((aligned(8)));
    uint32_t callSubstate __attribute__ ((aligned(4)));
    uint32_t mediaId __attribute__ ((aligned(4)));
    uint32_t causeCode __attribute__ ((aligned(4)));
    ::vendor::qti::hardware::radio::ims::V1_0::RttMode rttMode __attribute__ ((aligned(4)));
    ::android::hardware::hidl_string sipAlternateUri __attribute__ ((aligned(8)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::CallDetails, callType) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::CallDetails, callDomain) == 4, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::CallDetails, extrasLength) == 8, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::CallDetails, extras) == 16, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::CallDetails, localAbility) == 32, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::CallDetails, peerAbility) == 48, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::CallDetails, callSubstate) == 64, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::CallDetails, mediaId) == 68, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::CallDetails, causeCode) == 72, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::CallDetails, rttMode) == 76, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::CallDetails, sipAlternateUri) == 80, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_6::CallDetails) == 96, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_6::CallDetails) == 8, "wrong alignment");

struct RedialInfo final {
    ::vendor::qti::hardware::radio::ims::V1_5::CallFailCause callFailReason __attribute__ ((aligned(4)));
    ::vendor::qti::hardware::radio::ims::V1_6::RadioTechType callFailRadioTech __attribute__ ((aligned(4)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::RedialInfo, callFailReason) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::RedialInfo, callFailRadioTech) == 4, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_6::RedialInfo) == 8, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_6::RedialInfo) == 4, "wrong alignment");

struct DialRequest final {
    ::android::hardware::hidl_string address __attribute__ ((aligned(8)));
    uint32_t clirMode __attribute__ ((aligned(4)));
    ::vendor::qti::hardware::radio::ims::V1_0::IpPresentation presentation __attribute__ ((aligned(4)));
    bool hasCallDetails __attribute__ ((aligned(1)));
    ::vendor::qti::hardware::radio::ims::V1_6::CallDetails callDetails __attribute__ ((aligned(8)));
    bool hasIsConferenceUri __attribute__ ((aligned(1)));
    bool isConferenceUri __attribute__ ((aligned(1)));
    bool hasIsCallPull __attribute__ ((aligned(1)));
    bool isCallPull __attribute__ ((aligned(1)));
    bool hasIsEncrypted __attribute__ ((aligned(1)));
    bool isEncrypted __attribute__ ((aligned(1)));
    ::vendor::qti::hardware::radio::ims::V1_4::MultiIdentityLineInfoHal multiLineInfo __attribute__ ((aligned(8)));
    ::vendor::qti::hardware::radio::ims::V1_6::RedialInfo redialInfo __attribute__ ((aligned(4)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::DialRequest, address) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::DialRequest, clirMode) == 16, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::DialRequest, presentation) == 20, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::DialRequest, hasCallDetails) == 24, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::DialRequest, callDetails) == 32, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::DialRequest, hasIsConferenceUri) == 128, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::DialRequest, isConferenceUri) == 129, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::DialRequest, hasIsCallPull) == 130, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::DialRequest, isCallPull) == 131, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::DialRequest, hasIsEncrypted) == 132, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::DialRequest, isEncrypted) == 133, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::DialRequest, multiLineInfo) == 136, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::DialRequest, redialInfo) == 160, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_6::DialRequest) == 168, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_6::DialRequest) == 8, "wrong alignment");

struct CallInfo final {
    ::vendor::qti::hardware::radio::ims::V1_0::CallState state __attribute__ ((aligned(4)));
    uint32_t index __attribute__ ((aligned(4)));
    uint32_t toa __attribute__ ((aligned(4)));
    bool hasIsMpty __attribute__ ((aligned(1)));
    bool isMpty __attribute__ ((aligned(1)));
    bool hasIsMT __attribute__ ((aligned(1)));
    bool isMT __attribute__ ((aligned(1)));
    ::vendor::qti::hardware::radio::ims::V1_4::MultiIdentityLineInfoHal mtMultiLineInfo __attribute__ ((aligned(8)));
    uint32_t als __attribute__ ((aligned(4)));
    bool hasIsVoice __attribute__ ((aligned(1)));
    bool isVoice __attribute__ ((aligned(1)));
    bool hasIsVoicePrivacy __attribute__ ((aligned(1)));
    bool isVoicePrivacy __attribute__ ((aligned(1)));
    ::android::hardware::hidl_string number __attribute__ ((aligned(8)));
    uint32_t numberPresentation __attribute__ ((aligned(4)));
    ::android::hardware::hidl_string name __attribute__ ((aligned(8)));
    uint32_t namePresentation __attribute__ ((aligned(4)));
    bool hasCallDetails __attribute__ ((aligned(1)));
    ::vendor::qti::hardware::radio::ims::V1_6::CallDetails callDetails __attribute__ ((aligned(8)));
    bool hasFailCause __attribute__ ((aligned(1)));
    ::vendor::qti::hardware::radio::ims::V1_5::CallFailCauseResponse failCause __attribute__ ((aligned(8)));
    bool hasIsEncrypted __attribute__ ((aligned(1)));
    bool isEncrypted __attribute__ ((aligned(1)));
    bool hasIsCalledPartyRinging __attribute__ ((aligned(1)));
    bool isCalledPartyRinging __attribute__ ((aligned(1)));
    ::android::hardware::hidl_string historyInfo __attribute__ ((aligned(8)));
    bool hasIsVideoConfSupported __attribute__ ((aligned(1)));
    bool isVideoConfSupported __attribute__ ((aligned(1)));
    ::vendor::qti::hardware::radio::ims::V1_3::VerstatInfo verstatInfo __attribute__ ((aligned(4)));
    ::vendor::qti::hardware::radio::ims::V1_5::TirMode tirMode __attribute__ ((aligned(4)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::CallInfo, state) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::CallInfo, index) == 4, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::CallInfo, toa) == 8, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::CallInfo, hasIsMpty) == 12, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::CallInfo, isMpty) == 13, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::CallInfo, hasIsMT) == 14, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::CallInfo, isMT) == 15, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::CallInfo, mtMultiLineInfo) == 16, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::CallInfo, als) == 40, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::CallInfo, hasIsVoice) == 44, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::CallInfo, isVoice) == 45, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::CallInfo, hasIsVoicePrivacy) == 46, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::CallInfo, isVoicePrivacy) == 47, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::CallInfo, number) == 48, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::CallInfo, numberPresentation) == 64, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::CallInfo, name) == 72, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::CallInfo, namePresentation) == 88, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::CallInfo, hasCallDetails) == 92, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::CallInfo, callDetails) == 96, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::CallInfo, hasFailCause) == 192, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::CallInfo, failCause) == 200, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::CallInfo, hasIsEncrypted) == 272, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::CallInfo, isEncrypted) == 273, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::CallInfo, hasIsCalledPartyRinging) == 274, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::CallInfo, isCalledPartyRinging) == 275, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::CallInfo, historyInfo) == 280, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::CallInfo, hasIsVideoConfSupported) == 296, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::CallInfo, isVideoConfSupported) == 297, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::CallInfo, verstatInfo) == 300, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::CallInfo, tirMode) == 308, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_6::CallInfo) == 312, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_6::CallInfo) == 8, "wrong alignment");

struct HandoverInfo final {
    ::vendor::qti::hardware::radio::ims::V1_0::HandoverType type __attribute__ ((aligned(4)));
    ::vendor::qti::hardware::radio::ims::V1_6::RadioTechType srcTech __attribute__ ((aligned(4)));
    ::vendor::qti::hardware::radio::ims::V1_6::RadioTechType targetTech __attribute__ ((aligned(4)));
    bool hasHoExtra __attribute__ ((aligned(1)));
    ::vendor::qti::hardware::radio::ims::V1_0::Extra hoExtra __attribute__ ((aligned(8)));
    ::android::hardware::hidl_string errorCode __attribute__ ((aligned(8)));
    ::android::hardware::hidl_string errorMessage __attribute__ ((aligned(8)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::HandoverInfo, type) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::HandoverInfo, srcTech) == 4, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::HandoverInfo, targetTech) == 8, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::HandoverInfo, hasHoExtra) == 12, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::HandoverInfo, hoExtra) == 16, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::HandoverInfo, errorCode) == 40, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::HandoverInfo, errorMessage) == 56, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_6::HandoverInfo) == 72, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_6::HandoverInfo) == 8, "wrong alignment");

struct CallLocation final {
    float radius __attribute__ ((aligned(4)));
    double latitude __attribute__ ((aligned(8)));
    double longitude __attribute__ ((aligned(8)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::CallLocation, radius) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::CallLocation, latitude) == 8, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::CallLocation, longitude) == 16, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_6::CallLocation) == 24, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_6::CallLocation) == 8, "wrong alignment");

enum class CallPriority : int32_t {
    URGENT = 0,
    NORMAL = 1 /* (::vendor::qti::hardware::radio::ims::V1_6::CallPriority.URGENT implicitly + 1) */,
};

struct CallComposerInfo final {
    uint32_t callId __attribute__ ((aligned(4)));
    ::vendor::qti::hardware::radio::ims::V1_6::CallPriority priority __attribute__ ((aligned(4)));
    ::android::hardware::hidl_vec<uint16_t> subject __attribute__ ((aligned(8)));
    ::vendor::qti::hardware::radio::ims::V1_6::CallLocation location __attribute__ ((aligned(8)));
    ::android::hardware::hidl_string imageUrl __attribute__ ((aligned(8)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::CallComposerInfo, callId) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::CallComposerInfo, priority) == 4, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::CallComposerInfo, subject) == 8, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::CallComposerInfo, location) == 24, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::CallComposerInfo, imageUrl) == 48, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_6::CallComposerInfo) == 64, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_6::CallComposerInfo) == 8, "wrong alignment");

struct AutoCallRejectionInfo final {
    ::vendor::qti::hardware::radio::ims::V1_6::CallType callType __attribute__ ((aligned(4)));
    ::vendor::qti::hardware::radio::ims::V1_5::CallFailCause autoRejectionCause __attribute__ ((aligned(4)));
    uint16_t sipErrorCode __attribute__ ((aligned(2)));
    ::android::hardware::hidl_string number __attribute__ ((aligned(8)));
    ::vendor::qti::hardware::radio::ims::V1_2::VerificationStatus verificationStatus __attribute__ ((aligned(4)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::AutoCallRejectionInfo, callType) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::AutoCallRejectionInfo, autoRejectionCause) == 4, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::AutoCallRejectionInfo, sipErrorCode) == 8, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::AutoCallRejectionInfo, number) == 16, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_6::AutoCallRejectionInfo, verificationStatus) == 32, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_6::AutoCallRejectionInfo) == 40, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_6::AutoCallRejectionInfo) == 8, "wrong alignment");

enum class GeoLocationDataStatus : int32_t {
    TIMEOUT = 0,
    NO_CIVIC_ADDRESS = 1 /* (::vendor::qti::hardware::radio::ims::V1_6::GeoLocationDataStatus.TIMEOUT implicitly + 1) */,
    ENGINE_LOCK = 2 /* (::vendor::qti::hardware::radio::ims::V1_6::GeoLocationDataStatus.NO_CIVIC_ADDRESS implicitly + 1) */,
    RESOLVED = 3 /* (::vendor::qti::hardware::radio::ims::V1_6::GeoLocationDataStatus.ENGINE_LOCK implicitly + 1) */,
};

//
// type declarations for package
//

template<typename>
static inline std::string toString(int32_t o);
static inline std::string toString(::vendor::qti::hardware::radio::ims::V1_6::ConfigItem o);

constexpr int32_t operator|(const ::vendor::qti::hardware::radio::ims::V1_6::ConfigItem lhs, const ::vendor::qti::hardware::radio::ims::V1_6::ConfigItem rhs) {
    return static_cast<int32_t>(static_cast<int32_t>(lhs) | static_cast<int32_t>(rhs));
}
